software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/InsertSpecimenCollectionGroup.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <InsertRequest xmlns="http://wapi.wustl.edu/WAPI">
            <object>
                <ns1:AbstractDomainObject activityStatus="Active"
                                          clinicalDiagnosis="Not Specified"
                                          clinicalStatus="Not Specified"
                                          collectionStatus="Pending"
                                          identifier="0"
                                          xsi:type="ns2:SpecimenCollectionGroup"
                                          xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.common.domain.ws"
                                          xmlns:ns2="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">
                    <ns2:specimenCollectionSite>
                        <ns2:Site dirtyEditFlag="false" identifier="1" remoteId="0" remoteManagedFlag="false"/>
                    </ns2:specimenCollectionSite>
                    <ns2:collectionProtocolEvent>
                        <ns2:CollectionProtocolEvent identifier="1" studyCalendarEventPoint="0.0"/>
                    </ns2:collectionProtocolEvent>
                    <ns2:collectionProtocolRegistration>
                        <ns2:CollectionProtocolRegistration identifier="1"/>
                    </ns2:collectionProtocolRegistration>
                </ns1:AbstractDomainObject>
            </object>
        </InsertRequest>
    </soapenv:Body>
</soapenv:Envelope>
